//Логічні розгалуження:
// - Є змінна х, якій ви надаєте довільне числове значення.
//Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
//(в першу, другу, третю или четверту частину години).
//- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
//- Користувач вводить або має два числа.
    //Потрібно знайти та вивести максимальне число з тих двох .
    //Також потрібно врахувати коли введені рівні числа.


//---------------------------------------------------------1-----------------------------------------------------------
let number = 0;
if (number !== 0) {
    document.write('<h2>Невірно</h2>')
}
else {
    document.write('<h2>Вірно</h2>')
}
//----------------------------------------------------------2-----------------------------------------------------------
let time = 0
if (time >=0 && time < 15) {
    document.write('<h2>Перша частина</h2>')
}if (time >=15 && time < 30) {
    document.write('<h2>Друга частина</h2>')
}if (time >=30 && time < 45) {
    document.write('<h2>Третя частина</h2>')
}if (time >=45 && time < 59) {
    document.write('<h2>Четверта частина</h2>')
}
//---------------------------------------------------------3------------------------------------------------------------
let day =11
if (day >=1 && day < 10) {
    document.write('<h2>Перша частина</h2>')
}if (day >=10 && day < 20) {
    document.write('<h2>Друга частина</h2>')
}if (day >=20 && day < 31) {
    document.write('<h2>Третя частина</h2>')
}
//--------------------------------------------------------4-------------------------------------------------------------
let dayNumber = parseInt(prompt('День тижня'));

switch (dayNumber) {
    case 1:
        console.log('Monday - Понеділок');
        break;
    case 2:
        console.log('Tuesday - Вівторок');
        break;
    case 3:
        console.log('Wednesday - Середа');
        break;
    case 4:
        console.log('Thursday - Четвер');
        break;
    case 5:
        console.log('Friday - П`ятниця' );
        break;
    case 6:
        console.log('Saturday - Субота');
        break;
    case 7:
        console.log('Sunday - Неділя');
}
