//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

//----------------------------------------1---------------------------------------------------------------
for (let i = 0; i < 10; i++) {
    document.write(`<h1>fzefzsefs</h1>`);
}
//----------------------------------------2----------------------------------------------------------------

for (let i = 0; i < 10; i++) {
    document.write(`<div>
<h3>Текст</h3>
${i}
</div>`);
}
//---------------------------------------------3-------------------------------------------------------------
let i = 0;
while (i < 20) {
    document.write(`<h1>okten school</h1>`);
    i++;
}
//----------------------------------------------4------------------------------------------------------------
let a = 0;
while (a < 20) {
    document.write(`
        <h1>book fantasy</h1>
        <p>book ${a}</p>
    `);
    a++;
}





